wkk0912/pic18f6621modify/pic18f6x2x.h


 /* header file for the MICROCHIP PIC18 microcontrollers
  * PIC18F6621
  * PIC18F6525
  * PIC18F8621
  * PIC18F8525
 */

#ifndef	__PIC18F6X2X_H

#define	__PIC18F6X2X_H

#if defined(_18F6621) || defined(_18F6525)
#define _18F6X2X
#endif

#if defined(_18F6525) || defined(_18F8525)
#define _18FX525
#endif

static volatile near unsigned char	TOSU		@ 0xFFF;
static volatile near unsigned char	TOSH		@ 0xFFE;
static volatile near unsigned char	TOSL		@ 0xFFD;
static volatile near unsigned char	STKPTR		@ 0xFFC;
static volatile near unsigned char	PCLATU		@ 0xFFB;
static volatile near unsigned char	PCLATH		@ 0xFFA;
static volatile near unsigned char	PCL		@ 0xFF9;
static volatile far  unsigned char *	TBLPTR		@ 0xFF6;
static volatile near unsigned char	TBLPTRU		@ 0xFF8;
static volatile near unsigned char	TBLPTRH		@ 0xFF7;
static volatile near unsigned char	TBLPTRL		@ 0xFF6;
static volatile near unsigned char	TABLAT		@ 0xFF5;
static volatile near unsigned char	PRODH		@ 0xFF4;
static volatile near unsigned char	PRODL		@ 0xFF3;
static volatile near unsigned char	INTCON		@ 0xFF2;
static          near unsigned char	INTCON2		@ 0xFF1;
static volatile near unsigned char	INTCON3		@ 0xFF0;
static volatile near unsigned char	INDF0		@ 0xFEF;
static volatile near unsigned char	POSTINC0	@ 0xFEE;
static volatile near unsigned char	POSTDEC0	@ 0xFED;
static volatile near unsigned char	PREINC0		@ 0xFEC;
static volatile near unsigned char	PLUSW0		@ 0xFEB;
static volatile near unsigned char	FSR0H		@ 0xFEA;
static volatile near unsigned char	FSR0L		@ 0xFE9;
static volatile near unsigned char	WREG		@ 0xFE8;
static volatile near unsigned char	INDF1		@ 0xFE7;
static volatile near unsigned char	POSTINC1	@ 0xFE6;
static volatile near unsigned char	POSTDEC1	@ 0xFE5;
static volatile near unsigned char	PREINC1		@ 0xFE4;
static volatile near unsigned char	PLUSW1		@ 0xFE3;
static volatile near unsigned char	FSR1H		@ 0xFE2;
static volatile near unsigned char	FSR1L		@ 0xFE1;
static          near unsigned char	BSR		@ 0xFE0;
static volatile near unsigned char	INDF2		@ 0xFDF;
static volatile near unsigned char	POSTINC2	@ 0xFDE;
static volatile near unsigned char	POSTDEC2	@ 0xFDD;
static volatile near unsigned char	PREINC2		@ 0xFDC;
static volatile near unsigned char	PLUSW2		@ 0xFDB;
static volatile near unsigned char	FSR2H		@ 0xFDA;
static volatile near unsigned char	FSR2L		@ 0xFD9;
static volatile near unsigned char	STATUS		@ 0xFD8;
static volatile near unsigned char	TMR0H		@ 0xFD7;
static volatile near unsigned char	TMR0L		@ 0xFD6;
// 16-Bit definition
static volatile near unsigned int	TMR0		@ 0xFD6;
static          near unsigned char	T0CON		@ 0xFD5;
static volatile near unsigned char	OSCCON		@ 0xFD3;
static volatile near unsigned char	LVDCON		@ 0xFD2;
static volatile near unsigned char	WDTCON		@ 0xFD1;
static volatile near unsigned char	RCON		@ 0xFD0;
static volatile near unsigned char	TMR1H		@ 0xFCF;
static volatile near unsigned char	TMR1L		@ 0xFCE;
// 16-Bit definition
static volatile near unsigned int	TMR1		@ 0xFCE;
static          near unsigned char	T1CON		@ 0xFCD;
static volatile near unsigned char	TMR2		@ 0xFCC;
static          near unsigned char	PR2		@ 0xFCB;
static          near unsigned char	T2CON		@ 0xFCA;
static volatile near unsigned char	SSPBUF		@ 0xFC9;
static          near unsigned char	SSPADD		@ 0xFC8;
static volatile near unsigned char	SSPSTAT		@ 0xFC7;
static volatile near unsigned char	SSPCON1		@ 0xFC6;
static volatile near unsigned char	SSPCON2		@ 0xFC5;
static volatile near unsigned char	ADRESH		@ 0xFC4;
static volatile near unsigned char	ADRESL		@ 0xFC3;
// 16-Bit definition
static volatile near unsigned int	ADRES		@ 0xFC3;
static volatile near unsigned char	ADCON0		@ 0xFC2;
static          near unsigned char	ADCON1		@ 0xFC1;
static          near unsigned char	ADCON2		@ 0xFC0;
static volatile near unsigned char	CCPR1H		@ 0xFBF;
static volatile near unsigned char	CCPR1L		@ 0xFBE;
// 16-Bit definition
static volatile near unsigned int	CCPR1		@ 0xFBE;
static volatile near unsigned char	CCP1CON		@ 0xFBD;
static volatile near unsigned char	CCPR2H		@ 0xFBC;
static volatile near unsigned char	CCPR2L		@ 0xFBB;
// 16-Bit definition
static volatile near unsigned int	CCPR2		@ 0xFBB;
static volatile near unsigned char	CCP2CON		@ 0xFBA;
static volatile near unsigned char	CCPR3H		@ 0xFB9;
static volatile near unsigned char	CCPR3L		@ 0xFB8;
// 16-Bit definition
static volatile near unsigned int	CCPR3		@ 0xFB8;
static volatile near unsigned char	CCP3CON		@ 0xFB7;
static volatile near unsigned char	ECCP1AS		@ 0xFB6;
static volatile near unsigned char	CVRCON		@ 0xFB5;
static volatile near unsigned char	CMCON		@ 0xFB4;
static volatile near unsigned char	TMR3H		@ 0xFB3;
static volatile near unsigned char	TMR3L		@ 0xFB2;
// 16-Bit definition
static volatile near unsigned int	TMR3		@ 0xFB2;
static          near unsigned char	T3CON		@ 0xFB1;
static volatile near unsigned char	PSPCON		@ 0xFB0;
static 		near unsigned char	SPBRG1		@ 0xFAF;
static volatile near unsigned char	RCREG1		@ 0xFAE;
static volatile near unsigned char	TXREG1		@ 0xFAD;
static volatile near unsigned char	TXSTA1		@ 0xFAC;
static volatile near unsigned char	RCSTA1		@ 0xFAB;
// alternate definitions for compatability with mono USART devices
static          near unsigned char	SPBRG		@ 0xFAF;
static volatile near unsigned char	RCREG		@ 0xFAE;
static volatile near unsigned char	TXREG		@ 0xFAD;
static volatile near unsigned char	TXSTA		@ 0xFAC;
static volatile near unsigned char	RCSTA		@ 0xFAB;
static          near unsigned char	EEADRH		@ 0xFAA;
static          near unsigned char	EEADR		@ 0xFA9;
static volatile near unsigned char	EEDATA		@ 0xFA8;
static volatile near unsigned char	EECON2		@ 0xFA7;
static volatile near unsigned char	EECON1		@ 0xFA6;
static          near unsigned char	IPR3		@ 0xFA5;
static volatile near unsigned char	PIR3		@ 0xFA4;
static          near unsigned char	PIE3		@ 0xFA3;
static          near unsigned char	IPR2		@ 0xFA2;
static volatile near unsigned char	PIR2		@ 0xFA1;
static          near unsigned char	PIE2		@ 0xFA0;
static          near unsigned char	IPR1		@ 0xF9F;
static volatile near unsigned char	PIR1		@ 0xF9E;
static          near unsigned char	PIE1		@ 0xF9D;
#ifndef _18F6X2X
static          near unsigned char	MEMCON		@ 0xF9C;
static volatile near unsigned char	TRISJ		@ 0xF9A;
static volatile near unsigned char	TRISH		@ 0xF99;
#endif
static volatile near unsigned char	TRISG		@ 0xF98;
static volatile near unsigned char	TRISF		@ 0xF97;
static volatile near unsigned char	TRISE		@ 0xF96;
static volatile near unsigned char	TRISD		@ 0xF95;
static volatile near unsigned char	TRISC		@ 0xF94;
static volatile near unsigned char	TRISB		@ 0xF93;
static volatile near unsigned char	TRISA		@ 0xF92;
#ifndef _18F6X2X
static volatile near unsigned char	LATJ		@ 0xF91;
static volatile near unsigned char	LATH		@ 0xF90;
#endif
static volatile near unsigned char	LATG		@ 0xF8F;
static volatile near unsigned char	LATF		@ 0xF8E;
static volatile near unsigned char	LATE		@ 0xF8D;
static volatile near unsigned char	LATD		@ 0xF8C;
static volatile near unsigned char	LATC		@ 0xF8B;
static volatile near unsigned char	LATB		@ 0xF8A;
static volatile near unsigned char	LATA		@ 0xF89;
#ifndef _18F6X2X
static volatile near unsigned char	PORTJ		@ 0xF88;
static volatile near unsigned char	PORTH		@ 0xF87;
#endif
static volatile near unsigned char	PORTG		@ 0xF86;
static volatile near unsigned char	PORTF		@ 0xF85;
static volatile near unsigned char	PORTE		@ 0xF84;
static volatile near unsigned char	PORTD		@ 0xF83;
static volatile near unsigned char	PORTC		@ 0xF82;
static volatile near unsigned char	PORTB		@ 0xF81;
static volatile near unsigned char	PORTA		@ 0xF80;
static          near unsigned char	SPBRGH		@ 0xF7F;
static volatile near unsigned char	BAUDCON		@ 0xF7E;
static          near unsigned char	SPBRGH2		@ 0xF7D;
static volatile near unsigned char	BAUDCON2	@ 0xF7C;
static          near unsigned char	ECCP1DEL	@ 0xF79;
static volatile near unsigned char	TMR4		@ 0xF78;
static          near unsigned char	PR4		@ 0xF77;
static          near unsigned char	T4CON		@ 0xF76;
static volatile near unsigned char	CCPR4H		@ 0xF75;
static volatile near unsigned char	CCPR4L		@ 0xF74;
// 16-Bit definition
static volatile near unsigned int	CCPR4		@ 0xF74;
static volatile near unsigned char	CCP4CON		@ 0xF73;
static volatile near unsigned char	CCPR5H		@ 0xF72;
static volatile near unsigned char	CCPR5L		@ 0xF71;
// 16-Bit definition
static volatile near unsigned int	CCPR5		@ 0xF71;
static volatile near unsigned char	CCP5CON		@ 0xF70;
static          near unsigned char	SPBRG2		@ 0xF6F;
static volatile near unsigned char	RCREG2		@ 0xF6E;
static volatile near unsigned char	TXREG2		@ 0xF6D;
static volatile near unsigned char	TXSTA2		@ 0xF6C;
static volatile near unsigned char	RCSTA2		@ 0xF6B;
static volatile near unsigned char	ECCP3AS		@ 0xF6A;
static          near unsigned char	ECCP3DEL	@ 0xF69;
static volatile near unsigned char	ECCP2AS		@ 0xF68;
static          near unsigned char	ECCP2DEL	@ 0xF67;


/* Definitions for STKPTR register */
static volatile near bit	STKUNF		@ ((unsigned)&STKPTR*8)+6;
static volatile near bit	STKFUL		@ ((unsigned)&STKPTR*8)+7;

