wkk0912/pic18f6621modify/pic18f6x2x.h
/* Definitions for INTCON register */
static volatile near bit	RBIF		@ ((unsigned)&INTCON*8)+0;
static volatile near bit	INT0IF		@ ((unsigned)&INTCON*8)+1;
static volatile near bit	TMR0IF		@ ((unsigned)&INTCON*8)+2;
static          near bit	RBIE		@ ((unsigned)&INTCON*8)+3;
static          near bit	INT0IE		@ ((unsigned)&INTCON*8)+4;
static          near bit	TMR0IE		@ ((unsigned)&INTCON*8)+5;
static          near bit	PEIE		@ ((unsigned)&INTCON*8)+6;
static          near bit	GIE		@ ((unsigned)&INTCON*8)+7;
/* Alternate definitions for INTCON register */
static          near bit	GIEL		@ ((unsigned)&INTCON*8)+6;
static          near bit	GIEH		@ ((unsigned)&INTCON*8)+7;

/* Definitions for INTCON2 register */
static          near bit	RBIP		@ ((unsigned)&INTCON2*8)+0;
static          near bit	INT3IP		@ ((unsigned)&INTCON2*8)+1;
static          near bit	TMR0IP		@ ((unsigned)&INTCON2*8)+2;
static          near bit	INTEDG3		@ ((unsigned)&INTCON2*8)+3;
static          near bit	INTEDG2		@ ((unsigned)&INTCON2*8)+4;
static          near bit	INTEDG1		@ ((unsigned)&INTCON2*8)+5;
static          near bit	INTEDG0		@ ((unsigned)&INTCON2*8)+6;
static          near bit	RBPU		@ ((unsigned)&INTCON2*8)+7;

/* Definitions for INTCON3 register */
static volatile near bit	INT1IF		@ ((unsigned)&INTCON3*8)+0;
static volatile near bit	INT2IF		@ ((unsigned)&INTCON3*8)+1;
static volatile near bit	INT3IF		@ ((unsigned)&INTCON3*8)+2;
static          near bit	INT1IE		@ ((unsigned)&INTCON3*8)+3;
static          near bit	INT2IE		@ ((unsigned)&INTCON3*8)+4;
static          near bit	INT3IE		@ ((unsigned)&INTCON3*8)+5;
static          near bit	INT1IP		@ ((unsigned)&INTCON3*8)+6;
static          near bit	INT2IP		@ ((unsigned)&INTCON3*8)+7;

/* Definitions for STATUS register */
static volatile near bit	CARRY		@ ((unsigned)&STATUS*8)+0;
static volatile near bit	DC		@ ((unsigned)&STATUS*8)+1;
static volatile near bit	ZERO		@ ((unsigned)&STATUS*8)+2;
static volatile near bit	OV		@ ((unsigned)&STATUS*8)+3;
static volatile near bit	NEGATIVE	@ ((unsigned)&STATUS*8)+4;

/* Definitions for T0CON register */
static          near bit	T0PS0		@ ((unsigned)&T0CON*8)+0;
static          near bit	T0PS1		@ ((unsigned)&T0CON*8)+1;
static          near bit	T0PS2		@ ((unsigned)&T0CON*8)+2;
static          near bit	PSA		@ ((unsigned)&T0CON*8)+3;
static          near bit	T0SE		@ ((unsigned)&T0CON*8)+4;
static          near bit	T0CS		@ ((unsigned)&T0CON*8)+5;
static          near bit	T08BIT		@ ((unsigned)&T0CON*8)+6;
static          near bit	TMR0ON		@ ((unsigned)&T0CON*8)+7;

/* Definitions for OSCCON register */
static          near bit	SCS		@ ((unsigned)&OSCCON*8)+0;

/* Definitions for LVDCON register */
static          near bit	LVDL0		@ ((unsigned)&LVDCON*8)+0;
static          near bit	LVDL1		@ ((unsigned)&LVDCON*8)+1;
static          near bit	LVDL2		@ ((unsigned)&LVDCON*8)+2;
static          near bit	LVDL3		@ ((unsigned)&LVDCON*8)+3;
static          near bit	LVDEN		@ ((unsigned)&LVDCON*8)+4;
static volatile near bit	IRVST		@ ((unsigned)&LVDCON*8)+5;

/* Definitions for WDTCON register */
static          near bit	SWDTE		@ ((unsigned)&WDTCON*8)+0;

/* Definitions for RCON register */
static volatile near bit	BOR		@ ((unsigned)&RCON*8)+0;
static volatile near bit	POR		@ ((unsigned)&RCON*8)+1;
static volatile near bit	PD		@ ((unsigned)&RCON*8)+2;
static volatile near bit	TO		@ ((unsigned)&RCON*8)+3;
static volatile near bit	RI		@ ((unsigned)&RCON*8)+4;
static          near bit	IPEN		@ ((unsigned)&RCON*8)+7;

/* Definitions for T1CON register */
static          near bit	TMR1ON		@ ((unsigned)&T1CON*8)+0;
static          near bit	TMR1CS		@ ((unsigned)&T1CON*8)+1;
static          near bit	T1SYNC		@ ((unsigned)&T1CON*8)+2;
static          near bit	T1OSCEN		@ ((unsigned)&T1CON*8)+3;
static          near bit	T1CKPS0		@ ((unsigned)&T1CON*8)+4;
static          near bit	T1CKPS1		@ ((unsigned)&T1CON*8)+5;
static          near bit	T1RD16		@ ((unsigned)&T1CON*8)+7;

/* Definitions for T2CON register */
static          near bit	T2CKPS0		@ ((unsigned)&T2CON*8)+0;
static          near bit	T2CKPS1		@ ((unsigned)&T2CON*8)+1;
static          near bit	TMR2ON		@ ((unsigned)&T2CON*8)+2;
static          near bit	T2OUTPS0	@ ((unsigned)&T2CON*8)+3;
static          near bit	T2OUTPS1	@ ((unsigned)&T2CON*8)+4;
static          near bit	T2OUTPS2	@ ((unsigned)&T2CON*8)+5;
static          near bit	T2OUTPS3	@ ((unsigned)&T2CON*8)+6;

/* Definitions for SSPSTAT register */
static volatile near bit	BF		@ ((unsigned)&SSPSTAT*8)+0;
static volatile near bit	UA		@ ((unsigned)&SSPSTAT*8)+1;
static volatile near bit	RW		@ ((unsigned)&SSPSTAT*8)+2;
static volatile near bit	START		@ ((unsigned)&SSPSTAT*8)+3;
static volatile near bit	STOP		@ ((unsigned)&SSPSTAT*8)+4;
static volatile near bit	DA		@ ((unsigned)&SSPSTAT*8)+5;
static          near bit	CKE		@ ((unsigned)&SSPSTAT*8)+6;
static          near bit	SMP		@ ((unsigned)&SSPSTAT*8)+7;

/* Definitions for SSPCON1 register */
static          near bit	SSPM0		@ ((unsigned)&SSPCON1*8)+0;
static          near bit	SSPM1		@ ((unsigned)&SSPCON1*8)+1;
static          near bit	SSPM2		@ ((unsigned)&SSPCON1*8)+2;
static          near bit	SSPM3		@ ((unsigned)&SSPCON1*8)+3;
static          near bit	CKP		@ ((unsigned)&SSPCON1*8)+4;
static          near bit	SSPEN		@ ((unsigned)&SSPCON1*8)+5;
static volatile near bit	SSPOV		@ ((unsigned)&SSPCON1*8)+6;
static volatile near bit	WCOL		@ ((unsigned)&SSPCON1*8)+7;

/* Definitions for SSPCON2 register */
static          near bit	SEN		@ ((unsigned)&SSPCON2*8)+0;
static volatile near bit	RSEN		@ ((unsigned)&SSPCON2*8)+1;
static volatile near bit	PEN		@ ((unsigned)&SSPCON2*8)+2;
static volatile near bit	RCEN		@ ((unsigned)&SSPCON2*8)+3;
static volatile near bit	ACKEN		@ ((unsigned)&SSPCON2*8)+4;
static volatile near bit	ACKDT		@ ((unsigned)&SSPCON2*8)+5;
static volatile near bit	ACKSTAT		@ ((unsigned)&SSPCON2*8)+6;
static          near bit	GCEN		@ ((unsigned)&SSPCON2*8)+7;

/* Definitions for ADCON0 register */
static          near bit	ADON		@ ((unsigned)&ADCON0*8)+0;
static volatile near bit	GODONE		@ ((unsigned)&ADCON0*8)+1;
static          near bit	CHS0		@ ((unsigned)&ADCON0*8)+2;
static          near bit	CHS1		@ ((unsigned)&ADCON0*8)+3;
static          near bit	CHS2		@ ((unsigned)&ADCON0*8)+4;
static          near bit	CHS3		@ ((unsigned)&ADCON0*8)+5;

/* Definitions for ADCON1 register */
static          near bit	PCFG0		@ ((unsigned)&ADCON1*8)+0;
static          near bit	PCFG1		@ ((unsigned)&ADCON1*8)+1;
static          near bit	PCFG2		@ ((unsigned)&ADCON1*8)+2;
static          near bit	PCFG3		@ ((unsigned)&ADCON1*8)+3;
static          near bit	VCFG0		@ ((unsigned)&ADCON1*8)+4;
static          near bit	VCFG1		@ ((unsigned)&ADCON1*8)+5;

/* Definitions for ADCON2 register */
static          near bit	ADCS0		@ ((unsigned)&ADCON2*8)+0;
static          near bit	ADCS1		@ ((unsigned)&ADCON2*8)+1;
static          near bit	ADCS2		@ ((unsigned)&ADCON2*8)+2;
static          near bit	ACQT0		@ ((unsigned)&ADCON2*8)+3;
static          near bit	ACQT1		@ ((unsigned)&ADCON2*8)+4;
static          near bit	ACQT2		@ ((unsigned)&ADCON2*8)+5;
static          near bit	ADFM		@ ((unsigned)&ADCON2*8)+7;

