wkk0912/pic18f6621modify/pic18f6x2x.h
/* Definitions for CCP1CON register */
static          near bit	CCP1M0		@ ((unsigned)&CCP1CON*8)+0;
static          near bit	CCP1M1		@ ((unsigned)&CCP1CON*8)+1;
static          near bit	CCP1M2		@ ((unsigned)&CCP1CON*8)+2;
static          near bit	CCP1M3		@ ((unsigned)&CCP1CON*8)+3;
static          near bit	DC1B0		@ ((unsigned)&CCP1CON*8)+4;
static          near bit	DC1B1		@ ((unsigned)&CCP1CON*8)+5;
static          near bit	P1M0		@ ((unsigned)&CCP1CON*8)+6;
static          near bit	P1M1		@ ((unsigned)&CCP1CON*8)+7;

/* Definitions for CCP2CON register */
static          near bit	CCP2M0		@ ((unsigned)&CCP2CON*8)+0;
static          near bit	CCP2M1		@ ((unsigned)&CCP2CON*8)+1;
static          near bit	CCP2M2		@ ((unsigned)&CCP2CON*8)+2;
static          near bit	CCP2M3		@ ((unsigned)&CCP2CON*8)+3;
static          near bit	DC2B0		@ ((unsigned)&CCP2CON*8)+4;
static          near bit	DC2B1		@ ((unsigned)&CCP2CON*8)+5;
static          near bit	P2M0		@ ((unsigned)&CCP2CON*8)+6;
static          near bit	P2M1		@ ((unsigned)&CCP2CON*8)+7;

/* Definitions for CCP3CON register */
static          near bit	CCP3M0		@ ((unsigned)&CCP3CON*8)+0;
static          near bit	CCP3M1		@ ((unsigned)&CCP3CON*8)+1;
static          near bit	CCP3M2		@ ((unsigned)&CCP3CON*8)+2;
static          near bit	CCP3M3		@ ((unsigned)&CCP3CON*8)+3;
static volatile near bit	CCP3Y		@ ((unsigned)&CCP3CON*8)+4;
static volatile near bit	CCP3X		@ ((unsigned)&CCP3CON*8)+5;
static          near bit	P3M0		@ ((unsigned)&CCP3CON*8)+6;
static          near bit	P3M1		@ ((unsigned)&CCP3CON*8)+7;

/* Definitions for ECCP1AS register */
static          near bit	PSS1BD0		@ ((unsigned)&ECCP1AS*8)+0;
static          near bit	PSS1BD1		@ ((unsigned)&ECCP1AS*8)+1;
static          near bit	PSS1AC0		@ ((unsigned)&ECCP1AS*8)+2;
static          near bit	PSS1AC1		@ ((unsigned)&ECCP1AS*8)+3;
static          near bit	ECCP1AS0	@ ((unsigned)&ECCP1AS*8)+4;
static          near bit	ECCP1AS1	@ ((unsigned)&ECCP1AS*8)+5;
static          near bit	ECCP1AS2	@ ((unsigned)&ECCP1AS*8)+6;
static volatile near bit	ECCP1ASE	@ ((unsigned)&ECCP1AS*8)+7;

/* Definitions for CVRCON register */
static          near bit	CVR0		@ ((unsigned)&CVRCON*8)+0;
static          near bit	CVR1		@ ((unsigned)&CVRCON*8)+1;
static          near bit	CVR2		@ ((unsigned)&CVRCON*8)+2;
static          near bit	CVR3		@ ((unsigned)&CVRCON*8)+3;
static          near bit	CVRSS		@ ((unsigned)&CVRCON*8)+4;
static          near bit	CVRR		@ ((unsigned)&CVRCON*8)+5;
static          near bit	CVROE		@ ((unsigned)&CVRCON*8)+6;
static          near bit	CVREN		@ ((unsigned)&CVRCON*8)+7;

/* Definitions for CMCON register */
static          near bit	CM0		@ ((unsigned)&CMCON*8)+0;
static          near bit	CM1		@ ((unsigned)&CMCON*8)+1;
static          near bit	CM2		@ ((unsigned)&CMCON*8)+2;
static          near bit	CIS		@ ((unsigned)&CMCON*8)+3;
static          near bit	C1INV		@ ((unsigned)&CMCON*8)+4;
static          near bit	C2INV		@ ((unsigned)&CMCON*8)+5;
static volatile near bit	C1OUT		@ ((unsigned)&CMCON*8)+6;
static volatile near bit	C2OUT		@ ((unsigned)&CMCON*8)+7;

/* Definitions for T3CON register */
static          near bit	TMR3ON		@ ((unsigned)&T3CON*8)+0;
static          near bit	TMR3CS		@ ((unsigned)&T3CON*8)+1;
static          near bit	T3SYNC		@ ((unsigned)&T3CON*8)+2;
static          near bit	T3CCP1		@ ((unsigned)&T3CON*8)+3;
static          near bit	T3CKPS0		@ ((unsigned)&T3CON*8)+4;
static          near bit	T3CKPS1		@ ((unsigned)&T3CON*8)+5;
static          near bit	T3CCP2		@ ((unsigned)&T3CON*8)+6;
static          near bit	T3RD16		@ ((unsigned)&T3CON*8)+7;

/* Definitions for PSPCON register */
static          near bit	PSPMODE		@ ((unsigned)&PSPCON*8)+4;
static volatile near bit	IBOV		@ ((unsigned)&PSPCON*8)+5;
static volatile near bit	OBF		@ ((unsigned)&PSPCON*8)+6;
static volatile near bit	IBF		@ ((unsigned)&PSPCON*8)+7;

/* Definitions for TXSTA register */
static volatile	near bit	TX9D1		@ ((unsigned)&TXSTA1*8)+0;	// 9th Bit of TX data
static volatile	near bit	TRMT1		@ ((unsigned)&TXSTA1*8)+1;	// TX shift reg. status bit
static		near bit	BRGH1		@ ((unsigned)&TXSTA1*8)+2;	// high baud rate select
static		near bit	SYNC1		@ ((unsigned)&TXSTA1*8)+4;	// USART mode select
static		near bit	TXEN1		@ ((unsigned)&TXSTA1*8)+5;	// transmit enable bit
static		near bit	TX91		@ ((unsigned)&TXSTA1*8)+6;	// 8/9-bit TX data select
static		near bit	CSRC1		@ ((unsigned)&TXSTA1*8)+7;	// CLK source select
// Alternate definitions for compatibility with mono USART devices
static volatile near bit	TX9D		@ ((unsigned)&TXSTA*8)+0;
static volatile near bit	TRMT		@ ((unsigned)&TXSTA*8)+1;
static          near bit	BRGH		@ ((unsigned)&TXSTA*8)+2;
static          near bit	SYNC		@ ((unsigned)&TXSTA*8)+4;
static          near bit	TXEN		@ ((unsigned)&TXSTA*8)+5;
static          near bit	TX9		@ ((unsigned)&TXSTA*8)+6;
static          near bit	CSRC		@ ((unsigned)&TXSTA*8)+7;

/* Definitions for RCSTA register */
static volatile	near bit	RX9D1		@ ((unsigned)&RCSTA1*8)+0;	// 9th Bit of RX data
static volatile	near bit	OERR1		@ ((unsigned)&RCSTA1*8)+1;	// overrun error
static volatile	near bit	FERR1		@ ((unsigned)&RCSTA1*8)+2;	// framing error
static		near bit	ADDEN1		@ ((unsigned)&RCSTA1*8)+3;	// address detect enable
static		near bit	CREN1		@ ((unsigned)&RCSTA1*8)+4;	// continuous recieve enable
static		near bit	SREN1		@ ((unsigned)&RCSTA1*8)+5;	// single recieve enable
static		near bit	RX91		@ ((unsigned)&RCSTA1*8)+6;	// 8/9-bit data reception
static		near bit	SPEN1		@ ((unsigned)&RCSTA1*8)+7;	// serial port enable
// Alternate definitions for compatibility with mono USART devices
static volatile near bit	RX9D		@ ((unsigned)&RCSTA*8)+0;
static volatile near bit	OERR		@ ((unsigned)&RCSTA*8)+1;
static volatile near bit	FERR		@ ((unsigned)&RCSTA*8)+2;
static          near bit	ADDEN		@ ((unsigned)&RCSTA*8)+3;
static          near bit	CREN		@ ((unsigned)&RCSTA*8)+4;
static          near bit	SREN		@ ((unsigned)&RCSTA*8)+5;
static          near bit	RX9		@ ((unsigned)&RCSTA*8)+6;
static          near bit	SPEN		@ ((unsigned)&RCSTA*8)+7;

