wkk0912/pic18f6621modify/pic18f6x2x.h
/* Definitions for LATB register */
static volatile near bit	LATB0		@ ((unsigned)&LATB*8)+0;
static volatile near bit	LATB1		@ ((unsigned)&LATB*8)+1;
static volatile near bit	LATB2		@ ((unsigned)&LATB*8)+2;
static volatile near bit	LATB3		@ ((unsigned)&LATB*8)+3;
static volatile near bit	LATB4		@ ((unsigned)&LATB*8)+4;
static volatile near bit	LATB5		@ ((unsigned)&LATB*8)+5;
static volatile near bit	LATB6		@ ((unsigned)&LATB*8)+6;
static volatile near bit	LATB7		@ ((unsigned)&LATB*8)+7;

/* Definitions for LATA register */
static volatile near bit	LATA0		@ ((unsigned)&LATA*8)+0;
static volatile near bit	LATA1		@ ((unsigned)&LATA*8)+1;
static volatile near bit	LATA2		@ ((unsigned)&LATA*8)+2;
static volatile near bit	LATA3		@ ((unsigned)&LATA*8)+3;
static volatile near bit	LATA4		@ ((unsigned)&LATA*8)+4;
static volatile near bit	LATA5		@ ((unsigned)&LATA*8)+5;
static volatile near bit	LATA6		@ ((unsigned)&LATA*8)+6;

#ifndef _18F6X2X
/* Definitions for PORTJ register */
static volatile near bit	RJ0		@ ((unsigned)&PORTJ*8)+0;
static volatile near bit	RJ1		@ ((unsigned)&PORTJ*8)+1;
static volatile near bit	RJ2		@ ((unsigned)&PORTJ*8)+2;
static volatile near bit	RJ3		@ ((unsigned)&PORTJ*8)+3;
static volatile near bit	RJ4		@ ((unsigned)&PORTJ*8)+4;
static volatile near bit	RJ5		@ ((unsigned)&PORTJ*8)+5;
static volatile near bit	RJ6		@ ((unsigned)&PORTJ*8)+6;
static volatile near bit	RJ7		@ ((unsigned)&PORTJ*8)+7;

/* Definitions for PORTH register */
static volatile near bit	RH0		@ ((unsigned)&PORTH*8)+0;
static volatile near bit	RH1		@ ((unsigned)&PORTH*8)+1;
static volatile near bit	RH2		@ ((unsigned)&PORTH*8)+2;
static volatile near bit	RH3		@ ((unsigned)&PORTH*8)+3;
static volatile near bit	RH4		@ ((unsigned)&PORTH*8)+4;
static volatile near bit	RH5		@ ((unsigned)&PORTH*8)+5;
static volatile near bit	RH6		@ ((unsigned)&PORTH*8)+6;
static volatile near bit	RH7		@ ((unsigned)&PORTH*8)+7;
#endif

/* Definitions for PORTG register */
static volatile near bit	RG0		@ ((unsigned)&PORTG*8)+0;
static volatile near bit	RG1		@ ((unsigned)&PORTG*8)+1;
static volatile near bit	RG2		@ ((unsigned)&PORTG*8)+2;
static volatile near bit	RG3		@ ((unsigned)&PORTG*8)+3;
static volatile near bit	RG4		@ ((unsigned)&PORTG*8)+4;
static volatile near bit	RG5		@ ((unsigned)&PORTG*8)+5;

/* Definitions for PORTF register */
static volatile near bit	RF0		@ ((unsigned)&PORTF*8)+0;
static volatile near bit	RF1		@ ((unsigned)&PORTF*8)+1;
static volatile near bit	RF2		@ ((unsigned)&PORTF*8)+2;
static volatile near bit	RF3		@ ((unsigned)&PORTF*8)+3;
static volatile near bit	RF4		@ ((unsigned)&PORTF*8)+4;
static volatile near bit	RF5		@ ((unsigned)&PORTF*8)+5;
static volatile near bit	RF6		@ ((unsigned)&PORTF*8)+6;
static volatile near bit	RF7		@ ((unsigned)&PORTF*8)+7;

/* Definitions for PORTE register */
static volatile near bit	RE0		@ ((unsigned)&PORTE*8)+0;
static volatile near bit	RE1		@ ((unsigned)&PORTE*8)+1;
static volatile near bit	RE2		@ ((unsigned)&PORTE*8)+2;
static volatile near bit	RE3		@ ((unsigned)&PORTE*8)+3;
static volatile near bit	RE4		@ ((unsigned)&PORTE*8)+4;
static volatile near bit	RE5		@ ((unsigned)&PORTE*8)+5;
static volatile near bit	RE6		@ ((unsigned)&PORTE*8)+6;
static volatile near bit	RE7		@ ((unsigned)&PORTE*8)+7;

/* Definitions for PORTD register */
static volatile near bit	RD0		@ ((unsigned)&PORTD*8)+0;
static volatile near bit	RD1		@ ((unsigned)&PORTD*8)+1;
static volatile near bit	RD2		@ ((unsigned)&PORTD*8)+2;
static volatile near bit	RD3		@ ((unsigned)&PORTD*8)+3;
static volatile near bit	RD4		@ ((unsigned)&PORTD*8)+4;
static volatile near bit	RD5		@ ((unsigned)&PORTD*8)+5;
static volatile near bit	RD6		@ ((unsigned)&PORTD*8)+6;
static volatile near bit	RD7		@ ((unsigned)&PORTD*8)+7;

/* Definitions for PORTC register */
static volatile near bit	RC0		@ ((unsigned)&PORTC*8)+0;
static volatile near bit	RC1		@ ((unsigned)&PORTC*8)+1;
static volatile near bit	RC2		@ ((unsigned)&PORTC*8)+2;
static volatile near bit	RC3		@ ((unsigned)&PORTC*8)+3;
static volatile near bit	RC4		@ ((unsigned)&PORTC*8)+4;
static volatile near bit	RC5		@ ((unsigned)&PORTC*8)+5;
static volatile near bit	RC6		@ ((unsigned)&PORTC*8)+6;
static volatile near bit	RC7		@ ((unsigned)&PORTC*8)+7;

/* Definitions for PORTB register */
static volatile near bit	RB0		@ ((unsigned)&PORTB*8)+0;
static volatile near bit	RB1		@ ((unsigned)&PORTB*8)+1;
static volatile near bit	RB2		@ ((unsigned)&PORTB*8)+2;
static volatile near bit	RB3		@ ((unsigned)&PORTB*8)+3;
static volatile near bit	RB4		@ ((unsigned)&PORTB*8)+4;
static volatile near bit	RB5		@ ((unsigned)&PORTB*8)+5;
static volatile near bit	RB6		@ ((unsigned)&PORTB*8)+6;
static volatile near bit	RB7		@ ((unsigned)&PORTB*8)+7;

/* Definitions for PORTA register */
static volatile near bit	RA0		@ ((unsigned)&PORTA*8)+0;
static volatile near bit	RA1		@ ((unsigned)&PORTA*8)+1;
static volatile near bit	RA2		@ ((unsigned)&PORTA*8)+2;
static volatile near bit	RA3		@ ((unsigned)&PORTA*8)+3;
static volatile near bit	RA4		@ ((unsigned)&PORTA*8)+4;
static volatile near bit	RA5		@ ((unsigned)&PORTA*8)+5;
static volatile near bit	RA6		@ ((unsigned)&PORTA*8)+6;

/* Definitions for BAUDCON register */
static volatile near bit	ABDEN		@ ((unsigned)&BAUDCON*8)+0;
static volatile near bit	WUE		@ ((unsigned)&BAUDCON*8)+1;
static          near bit	BRG16		@ ((unsigned)&BAUDCON*8)+3;
static volatile near bit	SCKP		@ ((unsigned)&BAUDCON*8)+4;
static volatile near bit	RCIDL		@ ((unsigned)&BAUDCON*8)+6;

/* Definitions for BAUDCON2 register */
static volatile near bit	ABDEN2		@ ((unsigned)&BAUDCON2*8)+0;
static volatile near bit	WUE2		@ ((unsigned)&BAUDCON2*8)+1;
static          near bit	BRG162		@ ((unsigned)&BAUDCON2*8)+3;
static volatile near bit	SCKP2		@ ((unsigned)&BAUDCON2*8)+4;
static volatile near bit	RCIDL2		@ ((unsigned)&BAUDCON2*8)+6;

/* Definitions for ECCP1DEL register */
static          near bit	P1DC0		@ ((unsigned)&ECCP1DEL*8)+0;
static          near bit	P1DC1		@ ((unsigned)&ECCP1DEL*8)+1;
static          near bit	P1DC2		@ ((unsigned)&ECCP1DEL*8)+2;
static          near bit	P1DC3		@ ((unsigned)&ECCP1DEL*8)+3;
static          near bit	P1DC4		@ ((unsigned)&ECCP1DEL*8)+4;
static          near bit	P1DC5		@ ((unsigned)&ECCP1DEL*8)+5;
static          near bit	P1DC6		@ ((unsigned)&ECCP1DEL*8)+6;
static          near bit	P1RSEN		@ ((unsigned)&ECCP1DEL*8)+7;

