wkk0912/pic18f6621modify/pic18f6x2x.h
/* Definitions for T4CON register */
static          near bit	T4CKPS0		@ ((unsigned)&T4CON*8)+0;
static          near bit	T4CKPS1		@ ((unsigned)&T4CON*8)+1;
static          near bit	TMR4ON		@ ((unsigned)&T4CON*8)+2;
static          near bit	TOUTPS0		@ ((unsigned)&T4CON*8)+3;
static          near bit	TOUTPS1		@ ((unsigned)&T4CON*8)+4;
static          near bit	TOUTPS2		@ ((unsigned)&T4CON*8)+5;
static          near bit	TOUTPS3		@ ((unsigned)&T4CON*8)+6;

/* Definitions for CCP4CON register */
static          near bit	CCP4M0		@ ((unsigned)&CCP4CON*8)+0;
static          near bit	CCP4M1		@ ((unsigned)&CCP4CON*8)+1;
static          near bit	CCP4M2		@ ((unsigned)&CCP4CON*8)+2;
static          near bit	CCP4M3		@ ((unsigned)&CCP4CON*8)+3;
static volatile near bit	CCP4Y		@ ((unsigned)&CCP4CON*8)+4;
static volatile near bit	CCP4X		@ ((unsigned)&CCP4CON*8)+5;

/* Definitions for CCP5CON register */
static          near bit	CCP5M0		@ ((unsigned)&CCP5CON*8)+0;
static          near bit	CCP5M1		@ ((unsigned)&CCP5CON*8)+1;
static          near bit	CCP5M2		@ ((unsigned)&CCP5CON*8)+2;
static          near bit	CCP5M3		@ ((unsigned)&CCP5CON*8)+3;
static volatile near bit	CCP5Y		@ ((unsigned)&CCP5CON*8)+4;
static volatile near bit	CCP5X		@ ((unsigned)&CCP5CON*8)+5;

/* Definitions for TXSTA2 register */
static volatile near bit	TX9D2		@ ((unsigned)&TXSTA2*8)+0;
static volatile near bit	TRMT2		@ ((unsigned)&TXSTA2*8)+1;
static          near bit	BRGH2		@ ((unsigned)&TXSTA2*8)+2;
static          near bit	SENDB2		@ ((unsigned)&TXSTA2*8)+3;
static          near bit	SYNC2		@ ((unsigned)&TXSTA2*8)+4;
static          near bit	TXEN2		@ ((unsigned)&TXSTA2*8)+5;
static          near bit	TX92		@ ((unsigned)&TXSTA2*8)+6;
static          near bit	CSRC2		@ ((unsigned)&TXSTA2*8)+7;

/* Definitions for RCSTA2 register */
static volatile near bit	RX9D2		@ ((unsigned)&RCSTA2*8)+0;
static volatile near bit	OERR2		@ ((unsigned)&RCSTA2*8)+1;
static volatile near bit	FERR2		@ ((unsigned)&RCSTA2*8)+2;
static          near bit	ADEN2		@ ((unsigned)&RCSTA2*8)+3;
static          near bit	CREN2		@ ((unsigned)&RCSTA2*8)+4;
static          near bit	SREN2		@ ((unsigned)&RCSTA2*8)+5;
static          near bit	RX92		@ ((unsigned)&RCSTA2*8)+6;
static          near bit	SPEN2		@ ((unsigned)&RCSTA2*8)+7;

/* Definitions for ECCP3AS register */
static          near bit	PSS3BD0		@ ((unsigned)&ECCP3AS*8)+0;
static          near bit	PSS3BD1		@ ((unsigned)&ECCP3AS*8)+1;
static          near bit	PSS3AC0		@ ((unsigned)&ECCP3AS*8)+2;
static          near bit	PSS3AC1		@ ((unsigned)&ECCP3AS*8)+3;
static          near bit	ECCP3AS0	@ ((unsigned)&ECCP3AS*8)+4;
static          near bit	ECCP3AS1	@ ((unsigned)&ECCP3AS*8)+5;
static          near bit	ECCP3AS2	@ ((unsigned)&ECCP3AS*8)+6;
static volatile near bit	ECCP3ASE	@ ((unsigned)&ECCP3AS*8)+7;

/* Definitions for ECCP3DEL register */
static          near bit	P3DC0		@ ((unsigned)&ECCP3DEL*8)+0;
static          near bit	P3DC1		@ ((unsigned)&ECCP3DEL*8)+1;
static          near bit	P3DC2		@ ((unsigned)&ECCP3DEL*8)+2;
static          near bit	P3DC3		@ ((unsigned)&ECCP3DEL*8)+3;
static          near bit	P3DC4		@ ((unsigned)&ECCP3DEL*8)+4;
static          near bit	P3DC5		@ ((unsigned)&ECCP3DEL*8)+5;
static          near bit	P3DC6		@ ((unsigned)&ECCP3DEL*8)+6;
static          near bit	P3RSEN		@ ((unsigned)&ECCP3DEL*8)+7;

/* Definitions for ECCP2AS register */
static          near bit	PSS2BD0		@ ((unsigned)&ECCP2AS*8)+0;
static          near bit	PSS2BD1		@ ((unsigned)&ECCP2AS*8)+1;
static          near bit	PSS2AC0		@ ((unsigned)&ECCP2AS*8)+2;
static          near bit	PSS2AC1		@ ((unsigned)&ECCP2AS*8)+3;
static          near bit	ECCP2AS0	@ ((unsigned)&ECCP2AS*8)+4;
static          near bit	ECCP2AS1	@ ((unsigned)&ECCP2AS*8)+5;
static          near bit	ECCP2AS2	@ ((unsigned)&ECCP2AS*8)+6;
static volatile near bit	ECCP2ASE	@ ((unsigned)&ECCP2AS*8)+7;

/* Definitions for ECCP2DEL register */
static          near bit	P2DC0		@ ((unsigned)&ECCP2DEL*8)+0;
static          near bit	P2DC1		@ ((unsigned)&ECCP2DEL*8)+1;
static          near bit	P2DC2		@ ((unsigned)&ECCP2DEL*8)+2;
static          near bit	P2DC3		@ ((unsigned)&ECCP2DEL*8)+3;
static          near bit	P2DC4		@ ((unsigned)&ECCP2DEL*8)+4;
static          near bit	P2DC5		@ ((unsigned)&ECCP2DEL*8)+5;
static          near bit	P2DC6		@ ((unsigned)&ECCP2DEL*8)+6;
static          near bit	P2RSEN		@ ((unsigned)&ECCP2DEL*8)+7;


#define EEPROM_SIZE 1024

#if defined(_18FX525)
#define ROMSIZE 49152
#else
#define ROMSIZE 65536
#endif

// Configuration Bit Values

// Configuration register 1
 #define OSCSEN		0xDFFF 	// enable oscillator system clock switch 
 #define OSCSDIS	0xFFFF 
 #define RCRA6		0xFFFF 	// RC RA6=OSC2 
 #define HSSW		0xFEFF 	// HS with SW 4xPLL 
 #define ECSW		0xFDFF 	// EC osc + SW 4xPLL 
 #define ECHW		0xFCFF 	// EC osc + HW 4xPLL 
 #define RC		0xF7FF 	// RC osc with RA6 
 #define HSHW		0xF6FF 	// HS osc + HW 4xPLL 
 #define EC		0xF5FF 	// EC with RA6 
 #define ECDB4		0xF4FF 	// EC with OSC2/4 
 #define RCDB4		0xF3FF 	// RC with OSC2/4 
 #define HS		0xF2FF 	// HS osc 
 #define XT		0xF1FF 	// XT osc 
 #define LP		0xF0FF 	// LP osc 

// Configuration register 2
 #define BOREN		0xFFFF 	// included only for completeness 
 #define BORDIS		0xFFFD 	// Brown out reset disabled 
 #define BORV45		0xFFF3 	// Brown out reset enabled, reset at 4.5V 
 #define BORV42		0xFFF7 	// Brown out reset enabled, reset at 4.2V 
 #define BORV27		0xFFFB 	// Brown out reset enabled, reset at 2.7V 
 #define BORV20		0xFFFF 	// Brown out reset enabled, reset at 2.5V 
 #define PWRTEN		0xFFFE 	// Power-up timer enable 
 #define PWRTDIS	0xFFFF 	// Power-up timer disable 
 #define WDTPS1		0xE1FF 	// Watchdog timer enabled with prescaler(s) 
 #define WDTPS2		0xE3FF 
 #define WDTPS4		0xE5FF 
 #define WDTPS8		0xE7FF 
 #define WDTPS16	0xE9FF 
 #define WDTPS32	0xEBFF 
 #define WDTPS64	0xEDFF 
 #define WDTPS128	0xEFFF 
 #define WDTPS256	0xF1FF 
 #define WDTPS512	0xF3FF 
 #define WDTPS1K	0xF5FF 
 #define WDTPS2K	0xF7FF 
 #define WDTPS4K	0xF9FF 
 #define WDTPS8K	0xFBFF 
 #define WDTPS16K	0xFDFF 
 #define WDTPS32K	0xFFFF 
 #define WDTDIS		0xFEFF 	// Watchdog timer disabled 
 #define WDTEN		0xFFFF 	// included only for completeness 

// Configuration register 3
#ifndef _18F6X2X
 #define WAITEN		0xFF7F 	// WAIT mode active & determined by WAIT1:WAIT0 bits 
 #define WAITDIS	0xFFFF 	// WAIT mode inactive 
 #define MCU		0xFFFF 	// select microcontroller mode 
 #define MPU		0xFFFE 	// select microprocessor mode 
 #define MPUBB		0xFFFD 	// select microprocessor mode with boot block mode 
 #define XMCU		0xFFFC 	// select extended microcontroller mode 
 #define ECCPRE		0xFFFF 	// ECCP1/3 multiplexed to RE6-3 
 #define ECCPRH		0xFDFF 	// ECCP1/3 multiplexed to RH7-4 
 #define CCP2RB3	0xFEFF 	// CCP2 multiplexed to RB3 
#endif
 #define MCLREN		0xFFFF 	// MCLR pin enabled 
 #define MCLRDIS	0x7FFF 	// Disable MCLR 
 #define CCP2RC1	0xFFFF 	// CCP2 multiplexed to RC1 
 #define CCP2RE7	0xFEFF 	// CCP2 multiplexed to RE7 

// Configuration register 4
 #define DEBUGEN	0xFF7F 	// Debugger enabled 
 #define DEBUGDIS	0xFFFF 	// Debugger disabled 
 #define LVPEN		0xFFFF 	// Low voltage ISP enabled 
 #define LVPDIS		0xFFFB 	// Low voltage ISP disabled 
 #define STVREN		0xFFFF 	// Stack over/underflow will cause reset 
 #define STVRDIS	0xFFFE 	// Stack over/underflow will not cause reset 

// Configuration register 5
 #define UNPROTECT	0xFFFF 	// Do not protect memory 
 #define CPA		0xFFF0 	// Protect program memory sections 
#ifndef _18FX525
 #define CP3		0xFFF7 	// Protect program memory block 3 
#endif
 #define CP2		0xFFFB 	// Protect program memory block 2 
 #define CP1		0xFFFD 	// Protect program memory block 1 
 #define CP0		0xFFFE 	// Protect program memory block 0 
 #define CPD		0x7FFF 	// Protect EEPROM data 
 #define CPB		0xBFFF 	// Protect boot block 
 #define CPALL		0x3FF0 	// Protect all of the above 

// Configuration register 6
 #define WRTEN		0xFFFF 	// Write enabled 
 #define WPA		0xFFF0 	// Write protect program memory sections 
#ifndef _18FX525
 #define WP3		0xFFF7 	// Write protect program memory block 3 
#endif
 #define WP2		0xFFFB 	// Write protect program memory block 2 
 #define WP1		0xFFFD 	// Write protect program memory block 1 
 #define WP0		0xFFFE 	// Write protect program memory block 0 
 #define WPD		0x7FFF 	// Write protect EEPROM data 
 #define WPB		0xBFFF 	// Write protect boot block 
 #define WPC		0xDFFF 	// Write protect configuration registers 
 #define WPALL		0x1FF0 	// Write protect all of the above 

// Configuration register 7
 #define TRPA		0xFFF0 	// Table read protect program memory sections 
#ifndef _18FX525
 #define TRP3		0xFFF7 	// Table read protect program memory block 3 
#endif
 #define TRP2		0xFFFB 	// Table read protect program memory block 2 
 #define TRP1		0xFFFD 	// Table read protect program memory block 1 
 #define TRP0		0xFFFE 	// Table read protect program memory block 0 
 #define TRPB		0xBFFF 	// Table read protect boot block 
 #define TRPALL		0xBFF0 	// Table read protect all of the above 

#endif
